# Дан список пар «город — температура за день» (город встречается несколько раз, температура целая):
# temps = [("Москва", 3), ("Казань", 5), ("Сочи", 2), ("Москва", 4), ("Казань",3),
# ("Сочи", 1), ("Москва", 5), ("Сочи", 3)]
# Выведите:
# 1. Для каждого города в алфавитном порядке — среднюю температуру.
# 2. Самый тёплый город по средней температуре; если таких несколько — тот, кто раньше по
# алфавиту.
# Ожидаемый вывод:
# Казань: 4.0
# Москва: 4.0
# Сочи: 2.0
# Самый тёплый: Казань (4.0)

temps = [("Москва", 3), ("Казань", 5), ("Сочи", 2), ("Москва", 4), ("Казань",3),
("Сочи", 1), ("Москва", 5), ("Сочи", 3)]

cities = {}
for city, temp in temps:
    if city not in cities:
        cities[city] = [temp]
    else:
        cities[city].append(temp)

avg_temps = {}
for city in sorted(cities):
    avg = sum(cities[city]) / len(cities[city])
    avg_temps[city] = -1 * avg
    print(f'{city}: {avg}')

sort = sorted(avg_temps.items(), key=lambda x: (x[1], x[0]))
print(f"амый теплый {sort[0][0]} ({-1 * sort[0][1]})")
